Found 5216 validated image filenames belonging to 2 classes.
Found 16 validated image filenames belonging to 2 classes.
Found 624 validated image filenames belonging to 2 classes.

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 224, 224, 64)      1792      
                                                                 
 conv2d_1 (Conv2D)           (None, 224, 224, 64)      36928     
                                                                 
 max_pooling2d (MaxPooling2  (None, 112, 112, 64)      0         
 D)                                                              
                                                                 
 conv2d_2 (Conv2D)           (None, 112, 112, 128)     73856     
                                                                 
 conv2d_3 (Conv2D)           (None, 112, 112, 128)     147584    
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 56, 56, 128)       0         
 g2D)                                                            
                                                                 
 conv2d_4 (Conv2D)           (None, 56, 56, 256)       295168    
                                                                 
 conv2d_5 (Conv2D)           (None, 56, 56, 256)       590080    
                                                                 
 conv2d_6 (Conv2D)           (None, 56, 56, 256)       590080    
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 28, 28, 256)       0         
 g2D)                                                            
                                                                 
 conv2d_7 (Conv2D)           (None, 28, 28, 512)       1180160   
                                                                 
 conv2d_8 (Conv2D)           (None, 28, 28, 512)       2359808   
                                                                 
 conv2d_9 (Conv2D)           (None, 28, 28, 512)       2359808   
                                                                 
 max_pooling2d_3 (MaxPoolin  (None, 14, 14, 512)       0         
 g2D)                                                            
                                                                 
 conv2d_10 (Conv2D)          (None, 14, 14, 512)       2359808   
                                                                 
 conv2d_11 (Conv2D)          (None, 14, 14, 512)       2359808   
                                                                 
 conv2d_12 (Conv2D)          (None, 14, 14, 512)       2359808   
                                                                 
 max_pooling2d_4 (MaxPoolin  (None, 7, 7, 512)         0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 25088)             0         
                                                                 
 dense (Dense)               (None, 256)               6422784   
                                                                 
 dense_1 (Dense)             (None, 64)                16448     
                                                                 
 dense_2 (Dense)             (None, 2)                 130       
                                                                 
=================================================================
Total params: 21154050 (80.70 MB)
Trainable params: 21154050 (80.70 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Epoch 1/13
326/326 [==============================] - 1082s 3s/step - loss: 9.5310 - accuracy: 0.8186 - val_loss: 0.6942 - val_accuracy: 0.5625
Epoch 2/13
326/326 [==============================] - 1043s 3s/step - loss: 0.1581 - accuracy: 0.9388 - val_loss: 0.6869 - val_accuracy: 0.5625
Epoch 3/13
326/326 [==============================] - 1036s 3s/step - loss: 0.0914 - accuracy: 0.9693 - val_loss: 0.7873 - val_accuracy: 0.6875
Epoch 4/13
326/326 [==============================] - 1036s 3s/step - loss: 0.0989 - accuracy: 0.9661 - val_loss: 0.5956 - val_accuracy: 0.6250
Epoch 5/13
326/326 [==============================] - 1036s 3s/step - loss: 0.0628 - accuracy: 0.9791 - val_loss: 0.5626 - val_accuracy: 0.7500
Epoch 6/13
326/326 [==============================] - 1036s 3s/step - loss: 0.0479 - accuracy: 0.9833 - val_loss: 0.2774 - val_accuracy: 0.8750
Epoch 7/13
326/326 [==============================] - 1036s 3s/step - loss: 0.0544 - accuracy: 0.9791 - val_loss: 0.1945 - val_accuracy: 0.9375
Epoch 8/13
326/326 [==============================] - 1038s 3s/step - loss: 0.0340 - accuracy: 0.9881 - val_loss: 0.9667 - val_accuracy: 0.6875
Epoch 9/13
326/326 [==============================] - 1035s 3s/step - loss: 0.0327 - accuracy: 0.9875 - val_loss: 0.1869 - val_accuracy: 0.9375
Epoch 10/13
326/326 [==============================] - 1031s 3s/step - loss: 0.0306 - accuracy: 0.9887 - val_loss: 0.2073 - val_accuracy: 0.9375
Epoch 11/13
326/326 [==============================] - 1032s 3s/step - loss: 0.0202 - accuracy: 0.9927 - val_loss: 1.2581 - val_accuracy: 0.6875
Epoch 12/13
326/326 [==============================] - 1035s 3s/step - loss: 0.0224 - accuracy: 0.9927 - val_loss: 0.7981 - val_accuracy: 0.7500
Epoch 13/13
326/326 [==============================] - 1037s 3s/step - loss: 0.0215 - accuracy: 0.9935 - val_loss: 0.9844 - val_accuracy: 0.7500
326/326 [==============================] - 302s 926ms/step - loss: 0.0190 - accuracy: 0.9929
1/1 [==============================] - 1s 1s/step - loss: 0.9844 - accuracy: 0.7500
39/39 [==============================] - 36s 926ms/step - loss: 2.4014 - accuracy: 0.7580
Train Loss:  0.018996715545654297
Train Accuracy:  0.9929064512252808
--------------------
Validation Loss:  0.9844353199005127
Validation Accuracy:  0.75
--------------------
Test Loss:  2.4014365673065186
Test Accuracy:  0.7580128312110901
              precision    recall  f1-score   support

      NORMAL       0.95      0.38      0.54       234
   PNEUMONIA       0.73      0.99      0.84       390

    accuracy                           0.76       624
   macro avg       0.84      0.68      0.69       624
weighted avg       0.81      0.76      0.72       624